
INFO_EXTRACT_PROMPT = r"""上述图片都属于电梯【{classify}】部件，请依据这些图片总结电梯【{classify}】部件的共同关键特性，依据这些特性可以与其他类别的部件区别开。
要求:
1. 重点描述功能，组成，工作原理等特性，忽略与【{classify}】无关的特征。
2. 对于颜色信息，如果不能作为关键特性，请忽略。
3. 50个字以内。
4. 不要出现部件名称。
"""

IMAGE_EXTRACT_PROMPT = r"""此图片属于电梯【{classify}】部件，请对图片的关键特性进行描述。
要求:
1. 重点描述功能，组成，工作原理等特性。
2. 200个字以内。
3. 不要出现部件名称。
"""

SFT_USER_PROMPT1 = """<image>图片是电梯某个部件，已知有如下部件类别:【{types}】
请识别当前图片属于哪个类别，先对图片进行描述，再对描述进行总结，最后输出类别。 格式如下:
此图片的内容可以描述为:【xxx】
此描述可总结为:【yyy】
结合描述和总结最匹配的类别为:【zzz】
"""

SFT_ASSISTANT_PROMPT1 = """我对此图片的识别过程如下:
此图片的内容可以描述为:【{desc}】
此描述可总结为:【{conclusion}】
结合描述和总结最匹配的类别为:【{type}】
"""

SFT_USER_PROMPT = """<image>图片是电梯某个部件，已知有如下部件类别及序号:【{id_2_key}】
请识别当前图片属于哪个类别序号， 格式如下:
类别序号:【序号xxx】
"""

SFT_ASSISTANT_PROMPT = """类别序号:【{index}】"""

DPO_CLASSIFY_PROMPT = """<image>图片是电梯的某个部件，已知有如下部件类别及对应的描述信息:【{info}】
请依据图片内容及上述描述信息，识别当前图片属于哪个类别，先对图片进行描述，再输出类别。 格式如下:
描述:【xxx】,
此描述信息最匹配的类别:【yyy】
"""

DPO_ANSWER_PROMPT = """此图片的内容可以描述为:【{desc}】,
此描述信息最匹配的类别:【{type}】
"""


ANSWER_GEN_PROMPT = """此图片的内容可以描述为:【{desc}】
对比所有的部件类别描述: 【{info}】
此描述信息最匹配的类别:【{type}】
"""

