
from FlagEmbedding import FlagReranker


class FlagRanker:

    def __init__(self, conf):

        # self.reranker = FlagReranker('./bge-large-zh-v1.5-retriever-reranker-large', use_fp16=True)
        self.reranker = FlagReranker(conf.model_path)

    def pred(self, doc_qes):
        """
        scores = self.reranker.compute_score(
            [
                ['[城镇燃气管理条例（2016修正）] 第二十二条燃气经营者应当建立健全燃气质量检测制度，确保所供应的燃气质量符合国家标准。', '燃气经营单位需要建立哪些制度？'],
                ["[苏州市燃气管理办法(2020修正)] 第三章第十八条 燃气经营企业应当遵守下列规定：\n", '燃气经营单位需要建立哪些制度？'],
                ["[城镇燃气管理条例（2016修正）] 第四章燃气使用第二十七条燃气用户应当遵守安全用气规则，使用合格的燃气燃烧器具和气瓶，及时更换国家明令淘汰或者使用年限已届满的燃气燃烧器具、连接管等，并按照约定期限支付燃气费用。 单位燃气用户还应当建立健全安全管理制度，加强对操作维护人员燃气安全知识和操作技能的培训\n", '燃气经营单位需要建立哪些制度？'],
                ["[苏州市燃气管理办法(2020修正)] 第三章第十九条 管道燃气经营企业除遵守本办法第十八条规定外，还应当遵守下列规定：\n\n（一）按照燃气发展（专项）规划和燃气用户需求，制定并实施中长期发展规划和年度经营计划；\n（二）公布管道燃气安装、改装条件，不得拒绝燃气管网覆盖范围内符合供气条件的单位和个人的安装、改装申请；\n（三）不得拒绝向经验收合格的燃气管道设施供气；\n（四）设立并公布二十四小时服务电话，并为燃气用户查询、缴纳燃气费用和其他服务提供便利；\n（五）因气源紧张确需限制燃气用气量的，应当提前告知燃气用户，并将限制供气情况向燃气管理部门报告；\n（六）建立完善燃气管网地理信息系统和生产自动化控制系统，将相关信号接入燃气管理信息平台；\n（七）法律、法规、规章的其他规定。\n", '燃气经营单位需要建立哪些制度？']
            ]
        )
        """

        scores = self.reranker.compute_score(doc_qes)

        print(scores)

        return scores